3DR/wavetest/W5/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (  0 	-0.95 	 0)	//0
	(  2.15	-0.95	 0)	//1
	(  3.3	-0.95	 0)	//2
	(  4.3	-0.95	 0)	//3
	(  4.3	-0.7	 0)	//4
	(  3.3	-0.7	 0)	//5
	(  2.15	-0.7	 0)	//6
	(  0	-0.7	 0)	//7

	(  0	-0.95 	 0.2)	//8 
	(  2.15	-0.95	 0.2)  	//9
	(  3.3	-0.95	 0.2)	//10
	(  4.3	-0.95	 0.2)	//11
	(  4.3	-0.7	 0.2)	//12
	(  3.3	-0.7	 0.2)	//13
	(  2.15	-0.7	 0.2)	//14
	(  0	-0.7	 0.2)	//15

	(  0	-0.95	 0.65)	//16
	(  2.15	-0.95	 0.65)	//17
	(  3.3	-0.95	 0.65)	//18
	(  4.3	-0.95	 0.65)	//19
	(  4.3	-0.7	 0.65)	//20
	(  3.3	-0.7	 0.65)	//21
	(  2.15	-0.7	 0.65)	//22
	(  0	-0.7	 0.65)	//23

	(  0	-0.95	 1.2)	//24
	(  2.15	-0.95	 1.2)	//25
	(  3.3	-0.95	 1.2)	//26
	(  4.3	-0.95	 1.2)	//27
	(  4.3	-0.7	 1.2)	//28
	(  3.3	-0.7	 1.2)	//29
	(  2.15	-0.7	 1.2)	//30
	(  0	-0.7	 1.2)	//31
	
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Using second index number
    (  0	0.7  	 0)	//64	32
	(  2.15	0.7	 	 0)	//65	33
	(  3.3	0.7	 	 0)	//66	34
	(  4.3	0.7	 	 0)	//67	35
	(  4.3	0.95	 0)	//68	36
	(  3.3	0.95	 0)	//69	37
	(  2.15 0.95	 0)	//70	38
	(  0	0.95	 0)	//71	39

	(  0	0.7  	 0.2)	//72	40
	(  2.15	0.7	 	 0.2)   //73	41
	(  3.3	0.7	 	 0.2)	//74	42
	(  4.3	0.7	 	 0.2)	//75	43
	(  4.3	0.95	 0.2)	//76	44
	(  3.3	0.95	 0.2)	//77	45
	(  2.15	0.95	 0.2)	//78	46
	(  0	0.95	 0.2)	//79	47

	(  0	0.7	 	 0.65)	//80	48
	(  2.15	0.7	 	 0.65)	//81	49
	(  3.3	0.7		 0.65)	//82	50
	(  4.3	0.7	 	 0.65)	//83	51
	(  4.3	0.95	 0.65)	//84	52
	(  3.3	0.95	 0.65)	//85	53
	(  2.15	0.95	 0.65)	//86	54
	(  0	0.95	 0.65)	//87	55

	(  0	0.7	 	 1.2)	//88	56
	(  2.15	0.7	 	 1.2)	//89	57
	(  3.3	0.7	 	 1.2)	//90	58
	(  4.3	0.7	 	 1.2)	//91	59
	(  4.3	0.95	 1.2)	//92	60
	(  3.3	0.95	 1.2)	//93	61
	(  2.15	0.95	 1.2)	//94	62
	(  0	0.95	 1.2)	//95	63
	
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //	


	
);


blocks
(
hex (0 1 6 7 8 9 14 15) (108 13 10) simpleGrading (1  1  1)		//b0
hex (1 2 5 6 9 10 13 14) (58 13 10) simpleGrading (1  1  1)	  	//b1
hex (2 3 4 5 10 11 12 13) (50 13 10) simpleGrading (1  1  1)		//b2

hex (8 9 14 15 16 17 22 23) (108 13 23) simpleGrading (1  1  1)	//b3
hex (9 10 13 14 17 18 21 22) (58 13 23) simpleGrading (1  1  1)	//b4 *
hex (10 11 12 13 18 19 20 21) (50 13 23) simpleGrading (1  1  1)	//b5

hex (16 17 22 23 24 25 30 31) (108 13 27) simpleGrading (1  1  1)	//b6	
hex (17 18 21 22 25 26 29 30) (58 13 27) simpleGrading (1  1  1)	//b7
hex (18 19 20 21 26 27 28 29) (50 13 27) simpleGrading (1  1  1)	//b8

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hex (7 6 33 32 15 14 41 40) (108 70 10) simpleGrading (1  1  1)	//b9
hex (6 5 34 33 14 13 42 41) (58 70 10) simpleGrading (1  1  1)	//b10
hex (5 4 35 34 13 12 43 42) (50 70 10) simpleGrading (1  1  1)	//b11

hex (15 14 41 40 23 22 49 48) (108 70 23) simpleGrading (1  1  1)	//b12
hex (14 13 42 41 22 21 50 49) (58 70 23) simpleGrading (1  1  1)	//b13 *
hex (13 12 43 42 21 20 51 50) (50 70 23) simpleGrading (1  1  1)	//b14

hex (23 22 49 48 31 30 57 56) (108 70 27) simpleGrading (1  1  1)	//b15	
hex (22 21 50 49 30 29 58 57) (58 70 27) simpleGrading (1  1  1)	//b16
hex (21 20 51 50 29 28 59 58) (50 70 27) simpleGrading (1  1  1)	//b17

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hex (32 33 38 39 40 41 46 47) (108 13 10) simpleGrading (1  1  1)	//b18
hex (33 34 37 38 41 42 45 46) (58 13 10) simpleGrading (1  1  1)	//b19
hex (34 35 36 37 42 43 44 45) (50 13 10) simpleGrading (1  1  1)	//b20

hex (40 41 46 47 48 49 54 55) (108 13 23) simpleGrading (1  1  1)	//b21
hex (41 42 45 46 49 50 53 54) (58 13 23) simpleGrading (1  1  1)	//b22 *
hex (42 43 44 45 50 51 52 53) (50 13 23) simpleGrading (1  1  1)	//b23

hex (48 49 54 55 56 57 62 63) (108 13 27) simpleGrading (1  1  1)	//b24	
hex (49 50 53 54 57 58 61 62) (58 13 27) simpleGrading (1  1  1)	//b25
hex (50 51 52 53 58 59 60 61) (50 13 27) simpleGrading (1  1  1)	//b26

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
);


edges
(
);

boundary
(
    

    inlet
    {
        type patch;
        faces
        (
			(0	8	15	7)
			(8	16	23	15)
			(16	24	31	23)

			(7	15	40	32)
			(15	23	48	40)
			(23	31	56	48)

			(32	40	47	39)
			(40	48	55	47)
			(48	56	63	55)
        );
    }
	
    outlet
    {
        type patch;
        faces
        (
			(3	4	12	11)
			(11	12	20	19)
			(19	20	28	27)

			(4	35	43	12)
			(12	43	51	20)
			(20	51	59	28)

			(35	36	44	43)
			(43	44	52	51)
			(51	52	60	59)
        );
    }
	
    ground
    {
        type wall;
        faces
        (
			(0	7	6	1)
			(1	6	5	2)
			(2	5	4	3)
			
			(7	32	33	6)
			(6	33	34	5)
			(5	34	35	4)

			(32	39	38	33)
			(33	34	37	38)
			(34	37	35	36)

        );
    }
	
	
    walls
    {
        type patch;
        faces
        (
			(0	1	9	8)
			(1	2	10	9)
			(2	3	11	10)

			(8	9	16	17)
			(9	10	18	17)
			(10	11	19	18)

			(16	17	25	24)
			(17	18	26	25)
			(18	19	27	26)	//front


			(38	39	47	46)
			(37	38	46	45)
			(36	37	45	44)

			(46	47	55	54)
			(45	46	54	53)
			(44	45	53	52)

			(54	55	63	62)
			(53	54	62	61)
			(52	53	61	60)	//back
        );
    }
	
    atmosphere
    {
        type patch;
        faces
        (
			(24	25	30	31)
			(25	26	29	30)
			(26	27	28	29)

			(31	30	57	56)
			(30	29	58	57)
			(29	28	59	58)

			(56	57	62	63)
			(57	58	61	62)
			(58	59	60	61)
        );
    }
	
	

);

mergePatchPairs
(
);

// ************************************************************************* //
